Revit 2027 API
PrintManager.SubmitPrint Method
 Print the views and sheets defined in the current local PrintManager settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SubmitPrint()
Public Function SubmitPrint As Boolean
public:
bool SubmitPrint()
member SubmitPrint : unit -> bool
Return Value
Boolean
True if successful, otherwise False.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others.
Remarks
 PrintManager will apply the local settings to global and print the view/views/sheets which user defined with the current settings.
See Also
Reference
PrintManager Class
SubmitPrint Overload
Autodesk.Revit.DB Namespace